In [6]:
import pandas as pd
import numpy as np
from functools import reduce

# Series

```python
1.Series 由一组索引和一组Numpy的数据组成
2.索引：obj.index
  1）默认索引
  2）指定索引
  3）通过字典创建
  4）通过赋值的方式就地修改
3.通过索引取一个值或者几个值
4.numpy运算都会保留索引和数值之间的连接
5.pd.isnull pd.notnull
  obj.isnull obj.notnull
  obj.name = ''
  obj.index.name = ''
  
  pd.isnull 是pd.isna 的同义词
```

In [24]:
obj = pd.Series([4, 7, -5, 3])

In [25]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [26]:
obj.values

array([ 4,  7, -5,  3])

In [27]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
obj > 0

0     True
1     True
2    False
3     True
dtype: bool

In [29]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [30]:
sdata = {"Ohio":35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [31]:
obj3 = pd.Series(sdata)

In [32]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [33]:
type(obj3)

pandas.core.series.Series

In [34]:
t = pd.isnull(obj3)

In [35]:
t

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [36]:
pd.isnull

In [37]:
pd.isna

In [38]:
pd.isnull == pd.isna

True

In [39]:
id(pd.isnull)

4361373080

In [40]:
id(pd.isna)

4361373080

In [45]:
df = pd.DataFrame({'t1': ['a', 'b', 'c', ''],
                   't2': ['a', np.nan, '', 'd'],
                   't3': ['a', 'b', 'c', 'd']})

In [46]:
df

  t1   t2 t3
0  a    a  a
1  b  NaN  b
2  c       c
3       d  d

In [47]:
df['new'] = df['t1'] + df['t2'] + df['t3']

In [48]:
df

  t1   t2 t3  new
0  a    a  a  aaa
1  b  NaN  b  NaN
2  c       c   cc
3       d  d   dd

In [50]:
df['t2'].isna()  # '' 不是NaN

0    False
1     True
2    False
3    False
Name: t2, dtype: bool

In [51]:
df['t2'].isnull()

0    False
1     True
2    False
3    False
Name: t2, dtype: bool

In [52]:
df[df['t2'].isnull()]    # 选择第二行

  t1   t2 t3  new
1  b  NaN  b  NaN

In [53]:
df['t2'] == ''

0    False
1    False
2     True
3    False
Name: t2, dtype: bool

In [54]:
df[df['t2'] == '']

  t1 t2 t3 new
2  c     c  cc

# DataFrame

In [56]:
# 1.构建DataFrame
#  传入一个等长列表或者Numpy数组组成的字典

In [58]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year':[2000, 2001, 2002, 2001, 2002],
        'pop':[1.5, 1.7, 3.6, 4.8, 5.0]}

pd.DataFrame(data)   # 字典列表类型

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  4.8
4  Nevada  2002  5.0

In [60]:
# 根据columns指定列的顺序
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  4.8
4  2002  Nevada  5.0

In [64]:
df = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])   # 默认值NaN

In [65]:
df

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  4.8  NaN
five   2002  Nevada  5.0  NaN

In [67]:
# 取列
df['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [70]:
# loc: 用index名称获取行
# iloc: 用index的的具体位置(只能是整数)获取行
df.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [71]:
df.iloc[0: 3]

       year state  pop debt
one    2000  Ohio  1.5  NaN
two    2001  Ohio  1.7  NaN
three  2002  Ohio  3.6  NaN

In [73]:
df.loc[['one', 'two']]

     year state  pop debt
one  2000  Ohio  1.5  NaN
two  2001  Ohio  1.7  NaN

In [74]:
df.loc[:, ['year']]

       year
one    2000
two    2001
three  2002
four   2001
five   2002

In [75]:
df

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  4.8  NaN
five   2002  Nevada  5.0  NaN

In [79]:
df['debt'] = np.arange(5)

In [80]:
df

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  4.8     3
five   2002  Nevada  5.0     4

In [82]:
val = pd.Series([-1.2, -3.5, 4.0], index = ['two', 'four', 'five'])

In [83]:
val

two    -1.2
four   -3.5
five    4.0
dtype: float64

In [86]:
# 整列都替换掉，如果index没有覆盖的地方，则默认值为NaN
df['dept'] = val

In [87]:
df

       year   state  pop  debt  dept
one    2000    Ohio  1.5     0   NaN
two    2001    Ohio  1.7     1  -1.2
three  2002    Ohio  3.6     2   NaN
four   2001  Nevada  4.8     3  -3.5
five   2002  Nevada  5.0     4   4.0

In [89]:
# # 嵌套字典（外层键作为列，内层键作为行，内层字典的键会自动合并）
pop = {"Nevada": {2001: 2.4, 2002: 2.9}, "Ohio": {2000: 1.5, 2001: 1.7, 
2002: 3.7}}

In [93]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.7}}

In [98]:
# pd.DataFrame(pop, index=[2001,2002,2003])
df3 = pd.DataFrame(pop)

In [99]:
df3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.7

In [100]:
df3.index.name = 'year'
df3.columns.name = 'state'

In [101]:
df3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.7

In [122]:
df3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.7]])

In [131]:
# 矩阵创建DataFrame

df = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [132]:
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [133]:
# 重建索引: 行索引
df1 = df.reindex(['a', 'b', 'c', 'd'])

pd.DataFrame(pop, index=[2001,2002,2003])

In [134]:
df1

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [135]:
# 重建索引: 列索引
df2 = df.reindex(columns=['Texas', 'Ohio', 'California'])

In [136]:
df2

   Texas  Ohio  California
a      1     0           2
c      4     3           5
d      7     6           8

In [141]:
df.reindex(index=['a', 'b', 'c', 'd'], method='ffill')		# 行/列索引，默认值

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [139]:
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

# 索引对象

```python
# pandas索引对象负责管理轴标签和其他数据(比如轴名称)
# 1. 主要索引对象
# In [42]: pd.I					# pandas主要index对象
# pd.Index       pd.IndexSlice  pd.Int64Index
# In [42]: pd.MultiIndex				# pandas主要index对象
# In [42]: pd.DatetimeIndex			# pandas主要index对象
# pd.DatetimeIndex
# In [42]: pd.Period				# pandas主要index对象
# pd.Period       pd.PeriodIndex


# 2. Index的属性和方法
# append						# 连接另一个Index对象
# diff
# intersection
# union
# isin						# 一个指示各值是否包含在参数集合中的布尔数组
# delete
# drop
# insert
# is_monotonic
# is_unique
# unique
```

In [111]:
# 1. 重新索引（reindex）
s = pd.Series([4.5, 7.2, -2.1, 9.0], index=['d', 'b', 'a', 'c'])

In [112]:
s

d    4.5
b    7.2
a   -2.1
c    9.0
dtype: float64

In [114]:
# 重新索引(默认值NaN)
s1 = s.reindex(['a', 'b', 'c', 'd', 'e'])

In [115]:
s1

a   -2.1
b    7.2
c    9.0
d    4.5
e    NaN
dtype: float64

In [116]:
# 填充默认值
s.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -2.1
b    7.2
c    9.0
d    4.5
e    0.0
dtype: float64

In [117]:
s2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [118]:
s2

0      blue
2    purple
4    yellow
dtype: object

In [119]:
s2.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [120]:
# 向前填充
s2.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [121]:
# 向后填充
s2.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [145]:

l = [
['3247236868519526402', '2020-08-14 14:05:05', '10'],
['3247236868519526402', '2020-08-14 16:00:48', '10'],
['3247236868519526402', '2020-08-16 09:44:53', '10'],
['3247236868519526402', '2020-08-16 17:40:12', '10'],
['3247236868519526402', '2020-08-16 17:40:46', '13'],
['3247236868519526402', '2020-08-16 19:27:07', '61'],
['3247236868519526402', '2020-08-19 18:13:52', '61'],
['3247236868519526403', '2020-08-23 21:59:54', '61'],
['3247236868519526403', '2020-09-20 20:31:59', '64'],
['3247236868519526403', '2021-01-19 18:33:38', '61'],
['3247236868519526403', '2021-01-19 18:34:05', '64'],
['3247236868519526403', '2021-03-04 21:02:14', '61'],
['3247236868519526403', '2021-03-04 21:02:29', '64'],
['3247236868519526403', '2021-04-26 14:37:39', '64'],
['3247236868519526403', '2021-05-10 15:07:22', '64'],]

In [146]:
df = pd.DataFrame(l, columns=['customer_account_id', 'create_time', 'status'])

In [147]:
df['day'] = df['create_time'].apply(lambda x: x[:10])

In [148]:
df

    customer_account_id          create_time status         day
0   3247236868519526402  2020-08-14 14:05:05     10  2020-08-14
1   3247236868519526402  2020-08-14 16:00:48     10  2020-08-14
2   3247236868519526402  2020-08-16 09:44:53     10  2020-08-16
3   3247236868519526402  2020-08-16 17:40:12     10  2020-08-16
4   3247236868519526402  2020-08-16 17:40:46     13  2020-08-16
5   3247236868519526402  2020-08-16 19:27:07     61  2020-08-16
6   3247236868519526402  2020-08-19 18:13:52     61  2020-08-19
7   3247236868519526403  2020-08-23 21:59:54     61  2020-08-23
8   3247236868519526403  2020-09-20 20:31:59     64  2020-09-20
9   3247236868519526403  2021-01-19 18:33:38     61  2021-01-19
10  3247236868519526403  2021-01-19 18:34:05     64  2021-01-19
11  3247236868519526403  2021-03-04 21:02:14     61  2021-03-04
12  3247236868519526403  2021-03-04 21:02:29     64  2021-03-04
13  3247236868519526403  2021-04-26 14:37:39     64  2021-04-26
14  3247236868519526403  2021-05-10 15:07:22     64  2021-05-10

In [151]:
df.groupby(['customer_account_id', 'day'])['status'].apply(lambda x: list(set(','.join(x))))

customer_account_id  day
3247236868519526402  2020-08-14          [1, 0, ,]
                     2020-08-16    [6, 0, 3, 1, ,]
                     2020-08-19             [1, 6]
3247236868519526403  2020-08-23             [1, 6]
                     2020-09-20             [6, 4]
                     2021-01-19       [4, 1, 6, ,]
                     2021-03-04       [4, 1, 6, ,]
                     2021-04-26             [6, 4]
                     2021-05-10             [6, 4]
Name: status, dtype: object

In [181]:
one_day_status_df = df.groupby(['customer_account_id', 'day'])['status'].apply(lambda x:x.str.cat(sep=':')).reset_index()
# one_day_status_df = df.groupby(['day'])['status'].apply(lambda x:x.str.cat(sep=':')).reset_index()

In [182]:
one_day_status_df

   customer_account_id         day       status
0  3247236868519526402  2020-08-14        10:10
1  3247236868519526402  2020-08-16  10:10:13:61
2  3247236868519526402  2020-08-19           61
3  3247236868519526403  2020-08-23           61
4  3247236868519526403  2020-09-20           64
5  3247236868519526403  2021-01-19        61:64
6  3247236868519526403  2021-03-04        61:64
7  3247236868519526403  2021-04-26           64
8  3247236868519526403  2021-05-10           64

In [210]:
# 每一天的状态个数
one_day_status_df['one_day_status_cnt'] = one_day_status_df['status'].apply(lambda x: len(set(x.split(":"))))

In [211]:
one_day_status_df

   customer_account_id         day       status  one_day_status_cnt
0  3247236868519526402  2020-08-14        10:10                   1
1  3247236868519526402  2020-08-16  10:10:13:61                   3
2  3247236868519526402  2020-08-19           61                   1
3  3247236868519526403  2020-08-23           61                   1
4  3247236868519526403  2020-09-20           64                   1
5  3247236868519526403  2021-01-19        61:64                   2
6  3247236868519526403  2021-03-04        61:64                   2
7  3247236868519526403  2021-04-26           64                   1
8  3247236868519526403  2021-05-10           64                   1

In [206]:
one_day_status_df = df.groupby(['customer_account_id', 'day'])['status'].apply(lambda x:x.str.cat(sep=':')).reset_index()

In [226]:
def time_period_calc(time_list):
    time_status = ['0', '0', '0', '0']
    for x in time_list:
        hour = x[11:13]
        print(type(hour))
        if hour >= '00' and hour < '08':
            time_status[0] = '1'
        if hour >= '08' and hour < '12':
            time_status[1] = '1'
        if hour >= '12' and hour < '19':
            time_status[2] = '1'
        if hour >= '19' and hour < '24':
            time_status[3] = '1'
        
    return ''.join(time_status)

In [239]:
df.groupby(['customer_account_id', 'day'])['create_time'].apply(time_period_calc)

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

customer_account_id  day
3247236868519526402  2020-08-14    0010
                     2020-08-16    0111
                     2020-08-19    0010
3247236868519526403  2020-08-23    0001
                     2020-09-20    0001
                     2021-01-19    0010
                     2021-03-04    0001
                     2021-04-26    0010
                     2021-05-10    0010
Name: create_time, dtype: object

In [161]:
df['status_list'] = df.groupby(['customer_account_id', 'day'])['status'].apply(lambda x: ','.join(x))

TypeError: incompatible index of inserted column with frame index

In [160]:
one_day_status_df

customer_account_id  day
3247236868519526402  2020-08-14                                                10,10
                     2020-08-16                                          10,10,13,61
                     2020-08-19                                                   61
3247236868519526403  2020-08-23                                                   61
                     2020-09-20                                                   64
                     2021-01-19                                                61,64
                     2021-03-04                                                61,64
                     2021-04-26                                                   64
                     2021-05-10                                                   64
status_list                        customer_account_id  day
32472368685195...
Name: status, dtype: object

In [234]:
df.groupby(['customer_account_id', 'day'])['status'].apply(lambda x: len(set(x))).reset_index()['status']

0    1
1    3
2    1
3    1
4    1
5    2
6    2
7    1
8    1
Name: status, dtype: int64

In [235]:
df.groupby(['customer_account_id', 'day'])['status'].apply(lambda x: len(x)).reset_index()['status']

0    2
1    4
2    1
3    1
4    1
5    2
6    2
7    1
8    1
Name: status, dtype: int64

In [238]:
df.groupby(
    ['customer_account_id', 'day'])['status'].apply(
    lambda x: len(x)).reset_index()['status']

0    2
1    4
2    1
3    1
4    1
5    2
6    2
7    1
8    1
Name: status, dtype: int64

In [240]:
l1 = [
['user1', '2021-05-11'],
['user1', '2021-05-13'],
['user1', '2021-05-17'],
['user2', '2021-05-11'],
['user2', '2021-05-11'],
['user2', '2021-05-11'],
['user2', '2021-05-13'],
]

In [241]:
d1 = pd.DataFrame(l1, columns=['a', 'b'])

In [242]:
d1

       a           b
0  user1  2021-05-11
1  user1  2021-05-13
2  user1  2021-05-17
3  user2  2021-05-11
4  user2  2021-05-11
5  user2  2021-05-11
6  user2  2021-05-13

In [245]:
d2 = d1.groupby(['a'])['b'].agg(['min', 'max'])

In [246]:
d2

              min         max
a
user1  2021-05-11  2021-05-17
user2  2021-05-11  2021-05-13

In [247]:
def date_range(x):
    date_index = pd.date_range(start=x['min'], end=x['max'])
    res = date_index.format()
    return ','.join(res)

In [259]:
d3 = d2.apply(date_range, axis=1).reset_index()

In [267]:
d4 = d3.rename(columns={0: 'b'})

In [268]:
d4

       a                                                  b
0  user1  2021-05-11,2021-05-12,2021-05-13,2021-05-14,20...
1  user2                   2021-05-11,2021-05-12,2021-05-13

In [272]:
d4.set_index(['a'])['b'].str.split(",", expand=True)\
        .stack().reset_index(drop=True, level=-1).reset_index().rename(columns={0: 'b'})

       a           b
0  user1  2021-05-11
1  user1  2021-05-12
2  user1  2021-05-13
3  user1  2021-05-14
4  user1  2021-05-15
5  user1  2021-05-16
6  user1  2021-05-17
7  user2  2021-05-11
8  user2  2021-05-12
9  user2  2021-05-13

In [1]:
l1 = [
['3247247940982837249', '2020-05-01', 'test1'],
['3247247940982837249', '2020-05-01', 'test2'],
['3247247940982837250', '2020-05-02', 'test1'],
['3247247940982837250', '2020-05-02', 'test2'],
]


l2 = [
['3247247940982837249', '2020-05-01', 'test1'],
['3247247940982837249', '2020-05-01', 'test2'],
['3247247940982837250', '2020-05-02', 'test1'],
['3247247940982837250', '2020-05-02', 'test2'],
]


l3 = [
['3247247940982837249', '2020-05-01', 'test3'],
['3247247940982837249', '2020-05-01', 'test4'],
['3247247940982837250', '2020-05-02', 'test5'],
['3247247940982837250', '2020-05-02', 'test6'],
]

In [4]:
df1 = pd.DataFrame(l1, columns=['id', 'day', 'desc'])
df2 = pd.DataFrame(l2, columns=['id', 'day', 'desc'])
df3 = pd.DataFrame(l3, columns=['id', 'day', 'desc'])

In [10]:
df1.dtypes

id      object
day     object
desc    object
dtype: object

In [7]:
merge_df_list = [df1, df2, df3]

In [8]:
merge_df = reduce(lambda l, r: pd.merge(l, r, on=['id', 'day'], how='left'), merge_df_list)

In [9]:
merge_df

                     id         day desc_x desc_y   desc
0   3247247940982837249  2020-05-01  test1  test1  test3
1   3247247940982837249  2020-05-01  test1  test1  test4
2   3247247940982837249  2020-05-01  test1  test2  test3
3   3247247940982837249  2020-05-01  test1  test2  test4
4   3247247940982837249  2020-05-01  test2  test1  test3
5   3247247940982837249  2020-05-01  test2  test1  test4
6   3247247940982837249  2020-05-01  test2  test2  test3
7   3247247940982837249  2020-05-01  test2  test2  test4
8   3247247940982837250  2020-05-02  test1  test1  test5
9   3247247940982837250  2020-05-02  test1  test1  test6
10  3247247940982837250  2020-05-02  test1  test2  test5
11  3247247940982837250  2020-05-02  test1  test2  test6
12  3247247940982837250  2020-05-02  test2  test1  test5
13  3247247940982837250  2020-05-02  test2  test1  test6
14  3247247940982837250  2020-05-02  test2  test2  test5
15  3247247940982837250  2020-05-02  test2  test2  test6

In [45]:
# TODO ESMM, MMOE